"use strict";                  //строгий современый режим 

let nuber = 5;                 //можно перезаписать 
const leftBorderWidth = 1;     // нельзя перезаписать 

nuber = 10;                    //неошибка 
// leftBorderWidth = 2;        //ошибка
console.log(nuber); 

////////////////////////////////////////////////////////////////////////
const obj = {                 //изменения константы прямых констант в js не бывает      
    a: 50
};

obj .a= 10;
console.log(obj);

///////////////////////////////////////////////////////////////////////

console.log(name);
var name = "Timur";           //устаревший вариянт переменой 

{
    let result =50;           //если написать начале var то ошибки не будет 
}
console.log(result);

////////////////////////////////////////////////////////////////////////

let number = 4.6;

console.log(4/0);                   //Infinity числовой вид данных 
console.log("string" * 9);          //NaN не число 

////////////////////////////////////////////////////////////////////

const persone = "Timur";            // "строка", 'строка', `строка` 

/////////////////////////////////////////////////////////////////////

const bool = true;                  //"true"=да, "false"=нет булиновае значение

/////////////////////////////////////////////////////////////////////

console.log(something);             //null не сушествуеший обект 

/////////////////////////////////////////////////////////////////////

let und; 
console.log(und);                   //undefined нет значения     

/////////////////////////////////////////////////////////////////////

const obj = {                        //обект                       
    name: "Timur",                   //свойства обекта 
    age: 30,
    isMarried: false
}
//console.log(obj.name);              //обрашения к свойству обекта 
console.log(obj ["name"]);            //обрашения к свойству обекта

//////////////////////////////////////////////////////////////////////
                0           1        2      3         4     //ключ масива по умолчанию 
let arr = ['plum.png', 'orange.jpg', 6, 'apple.bmp', {}, []];     
console.log(arr[1]);                   //класический масив    

///////////////////////////////////////////////////////////////////////

const category = 'toys';                     
//console.log('https://timur.uz/' + category + '/' + '5');   //канкатенация строк 

console.log(`https://timur.uz/${category}/5`);     //интерполятция только с касыми кавычками ``

///////////////////////////////////////////////////////////////////////

alert('Hello');

const result = confirm("Are you here?");
console.log(result);

const answer = prompt("Вам есть 18?", "18");
console.log(answer);                                //вся информатция от пользователя будеть виде строки 

const answer = +prompt("Вам есть 18?", "18");
console.log(answer + 5);                            //динамическая типизатция 

const answers = [];

answers[0] = prompt('Как ваше имя', '');
answers[1] = prompt('Как ваше фамилия', '');
answers[2] = prompt('Сколько вам лет', '');

document.write(answers);

///////////////////////////////////////////////////////////////////////

const user = "Timur";
alert(`Привет, ${user}`);

/////////////////////////////////////////////////////////////////////

console.log('arr' + "-object");        //канкатенатция строки 
console.log(4 + +"5");                 //унарный плюс, плюсик ставится перед чемта 

/////////////////////////////////////////////////////////////////////

let incr = 10,                         
    decr =10;                          

incr++;                                //оператор инкримента увелечения на единицу
decr--;                                //оператор декримента уменшения на единицу 
console.log(incr);
console.log(decr);

console.log(5%2);                      //возврашает остаток деления двух чисел

console.log(2*4 == 8);                 //один раз (=) присвается два раз (==) сравнения три раз (===) строгое сравнения

//  &&                                 //оператор (и) работает тогда 2 или болше правдивых 
//  ||                                 //оператор (или) работает тогда одно правдивый 

// const isChecked = true,
//       isClouse = true;

// console.log(isChecked && isClouse);    //сработал оператор && (и) это верно и это верно 

// const isChecked = true,
//       isClouse = false;
// console.log(isChecked || isClouse);    //сработал оператор || (или) это верно

const isChecked = false,
      isClouse = false;
console.log(isClouse || !isChecked);     //сработал оператор отрицания (!)

////////////////////////////////////////////////////////////////////////

const numberofFilms = +prompt('Сколько фильмов вы уже посмотрели?', '');

const personalMovieDB = {
    count: numberofFilms,
    movies: {},
    actors: {},
    genres: [],
    privat: false
};

const a = prompt('Один из последних просмотренных фильмов?', ''),
      b = prompt('На сколько очените его?', ''),
      c = prompt('Один из последних просмотренных фильмов?', ''),
      d = prompt('На сколько оцените его?', '');
      
personalMovieDB.movies[a] = b;
personalMovieDB.movies[c] = d;



console.log(personalMovieDB);